dargor0/demo_esp32ledctl/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash and partition layout: BLE + WiFi + provisioning do not fit the default 1 MB app slot
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth (BLE) transport for provisioning
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n
# protocomm's BLE transport uses the legacy advertising API (BLE 4.2)
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Bigger main task stack while bringing up WiFi/BT
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# On-board addressable RGB LED data GPIO (DevKitC-1 v1.1)
CONFIG_APP_RGB_GPIO=48
